#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-eyyJRx6MKNNox7gx

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_apigatewayv2_api.lambda: Refreshing state... [id=sdwwn04i87]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220613060156176300000001]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.crawler_policy_attach1: Refreshing state... [id=crawler_role-20220613072735631200000002]
aws_iam_role_policy_attachment.crawler_policy_attach2: Refreshing state... [id=crawler_role-20220613072735631000000001]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=mwf2urb]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=jjdogw5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
      ~ handler                        = "package.crawler.lambda_function.lambda_handler" -> "crawler.lambda_function.lambda_handler"
        id                             = "crawler"
      ~ last_modified                  = "2022-06-14T05:40:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:847035122536:layer:boto3-latest:1",
        ] -> (known after apply)
      ~ source_code_hash               = "u5tudWiZ8HXqpo54Qd9AfhUI2UAC43lS4uR1v7bgwPw=" -> "RuvKIRuqbQMKYbAsskGVf0xHJpfWcj107n6vTmia6KQ="
        tags                           = {}
        # (16 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-14T03:11:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "UHTR0PNLay+hkp6W3SWTW+nbQJLnNxXFaIu4cYx88uU=" -> "HhUZDRNxj/vEV/eoyUOmj3/Mmx4aYTX7KKzgKin1tLI="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.boto3-layer will be created
  + resource "aws_lambda_layer_version" "boto3-layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + filename                    = "artifacts/boto3-layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "boto3-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*